In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("D:\\college\\Coding Ninja AI\\31_Project_Logistic_Regression\\train.csv")
df.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.00,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.05,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.00,NaN,S,0

In [3]:
print(df.shape)

(668, 11)

In [4]:
df=df.drop(["Name","Cabin","Ticket"], axis=1)
df.head(3)

   Pclass     Sex   Age  SibSp  Parch   Fare Embarked  Survived
0       2  female  29.0      1      0  26.00        S         1
1       3    male   NaN      0      0   8.05        S         0
2       2    male  39.0      0      0  26.00        S         0

In [5]:
df.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Fare          0
Embarked      1
Survived      0
dtype: int64

In [6]:
#handling SEX
genders = {"male": 0, "female": 1}
data1 = [df]

for dataset in data1:
    dataset['Sex'] = dataset['Sex'].map(genders)
data1

[     Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Survived
 0         2    1  29.0      1      0  26.0000        S         1
 1         3    0   NaN      0      0   8.0500        S         0
 2         2    0  39.0      0      0  26.0000        S         0
 3         3    1  29.0      0      4  21.0750        S         0
 4         3    0  25.0      0      0   7.0500        S         0
 ..      ...  ...   ...    ...    ...      ...      ...       ...
 663       2    1  17.0      0      0  10.5000        S         1
 664       3    0   NaN      0      0   7.7500        Q         0
 665       3    0  32.0      0      0  56.4958        S         1
 666       3    1  22.0      0      0   9.8375        S         0
 667       3    1   NaN      1      0  15.5000        Q         1

 [668 rows x 8 columns]]

In [7]:
embarked= {"S": 0, "Q": 1,"C":2}
data11 = [df]

for dataset in data11:
    dataset['Embarked'] = dataset['Embarked'].map(embarked)
data11

[     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Survived
 0         2    1  29.0      1      0  26.0000       0.0         1
 1         3    0   NaN      0      0   8.0500       0.0         0
 2         2    0  39.0      0      0  26.0000       0.0         0
 3         3    1  29.0      0      4  21.0750       0.0         0
 4         3    0  25.0      0      0   7.0500       0.0         0
 ..      ...  ...   ...    ...    ...      ...       ...       ...
 663       2    1  17.0      0      0  10.5000       0.0         1
 664       3    0   NaN      0      0   7.7500       1.0         0
 665       3    0  32.0      0      0  56.4958       0.0         1
 666       3    1  22.0      0      0   9.8375       0.0         0
 667       3    1   NaN      1      0  15.5000       1.0         1

 [668 rows x 8 columns]]

In [8]:
#handling empty values
mean = df["Age"].mean()
std = df["Age"].std() 
df.Age.fillna(mean,inplace=True)
df.Embarked.fillna(0,inplace=True)

In [9]:
df.head(3)

   Pclass  Sex       Age  SibSp  Parch   Fare  Embarked  Survived
0       2    1  29.00000      1      0  26.00       0.0         1
1       3    0  29.70056      0      0   8.05       0.0         0
2       2    0  39.00000      0      0  26.00       0.0         0

In [10]:
print(df.isnull().sum())

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [11]:
df

     Pclass  Sex       Age  SibSp  Parch     Fare  Embarked  Survived
0         2    1  29.00000      1      0  26.0000       0.0         1
1         3    0  29.70056      0      0   8.0500       0.0         0
2         2    0  39.00000      0      0  26.0000       0.0         0
3         3    1  29.00000      0      4  21.0750       0.0         0
4         3    0  25.00000      0      0   7.0500       0.0         0
..      ...  ...       ...    ...    ...      ...       ...       ...
663       2    1  17.00000      0      0  10.5000       0.0         1
664       3    0  29.70056      0      0   7.7500       1.0         0
665       3    0  32.00000      0      0  56.4958       0.0         1
666       3    1  22.00000      0      0   9.8375       0.0         0
667       3    1  29.70056      1      0  15.5000       1.0         1

[668 rows x 8 columns]

In [12]:
x_train_old=df.iloc[:,:-1]
y_train=df.iloc[:,-1]

In [13]:
y_train

0      1
1      0
2      0
3      0
4      0
      ..
663    1
664    0
665    1
666    0
667    1
Name: Survived, Length: 668, dtype: int64

In [14]:
df1=pd.read_csv("D:\\college\\Coding Ninja AI\\31_Project_Logistic_Regression\\test.csv")
df1=df1.drop(["Name","Cabin","Ticket"], axis=1)
df1.isnull().sum()

Pclass       0
Sex          0
Age         45
SibSp        0
Parch        0
Fare         0
Embarked     1
dtype: int64

In [15]:
genders = {"male": 0, "female": 1}
data01 = [df1]

for dataset in data01:
    dataset['Sex'] = dataset['Sex'].map(genders)

In [16]:
embarked= {"S": 0, "Q": 1,"C":2}
data001 = [df1]

for dataset in data001:
    dataset['Embarked'] = dataset['Embarked'].map(embarked)

In [17]:
#handling empty values
mean = df1["Age"].mean()
std = df1["Age"].std() 
df1.Age.fillna(mean,inplace=True)
df1.Embarked.fillna(0,inplace=True)

In [18]:
df1

     Pclass  Sex        Age  SibSp  Parch      Fare  Embarked
0         2    0   8.000000      1      1   36.7500       0.0
1         1    1  49.000000      0      0   25.9292       0.0
2         3    0  29.694775      0      0    7.7375       1.0
3         2    1  24.000000      2      1   27.0000       0.0
4         1    0  36.000000      0      0   26.2875       0.0
..      ...  ...        ...    ...    ...       ...       ...
218       3    0  20.000000      1      0    7.9250       0.0
219       1    0  45.000000      0      0   26.5500       0.0
220       1    1  17.000000      1      0  108.9000       2.0
221       3    0  43.000000      0      0    6.4500       0.0
222       2    0  36.500000      0      2   26.0000       0.0

[223 rows x 7 columns]

In [19]:
df1.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [20]:
x_test_old=df1.iloc[:,:]

In [30]:
from sklearn import preprocessing
var=preprocessing.MinMaxScaler()
var.fit(x_train_old)
x_train=var.transform(x_train_old)
x_test=var.transform(x_test_old)

In [ ]:
#StandardScaler

In [31]:
x_train

array([[0.5       , 1.        , 0.35711585, ..., 0.        , 0.05074862,
        0.        ],
       [1.        , 0.        , 0.3659468 , ..., 0.        , 0.01571255,
        0.        ],
       [0.5       , 0.        , 0.48317156, ..., 0.        , 0.05074862,
        0.        ],
       ...,
       [1.        , 0.        , 0.39493256, ..., 0.        , 0.11027246,
        0.        ],
       [1.        , 1.        , 0.26887684, ..., 0.        , 0.01920152,
        0.        ],
       [1.        , 1.        , 0.3659468 , ..., 0.        , 0.03025399,
        0.5       ]])

In [23]:
from sklearn.linear_model import LogisticRegression
clf=LogisticRegression()
clf.fit(x_train,y_train)

LogisticRegression()

In [24]:
clf.predict(x_test)

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [25]:
a=10

In [26]:
a

10

In [27]:
ls=[1,2,3]

In [28]:
ls

[1, 2, 3]